# Задача 20: В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко;D, G – 2 очка;B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;K – 5 очков;J, X – 8 очков;Q, Z – 10 очков.А русские буквы оцениваются так:А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;Б, Г, Ё, Ь, Я – 3 очка;Й, Ы – 4 очка;Ж, З, Х, Ц, Ч – 5 очков;Ш, Э, Ю – 8 очков;Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, что на вход подается только одно слово,
# которое содержит либо только английские, либо только русские буквы.
# ноутбук
# 12

a=input()
count=0
for i in range(len(a)):
    if a[i]== "а" or a[i]=="в" or a[i]=="е" or a[i]=="и" or a[i]== "н" or  a[i]=="о" or a[i]== "р" or a[i]=="с" or a[i]== "е"or a[i]== "т":
        count+=1
    if a[i]== "д" or a[i]=="к" or a[i]=="л" or a[i]=="м" or a[i]== "п" or  a[i]=="у" :
        count+=2
    if a[i]== "б" or a[i]=="г" or a[i]=="ё" or a[i]=="ь" or a[i]== "я" :
        count+=3 
    if a[i]== "й" or a[i]=="ы":
        count+=4    
    if a[i]== "ж" or a[i]=="з" or a[i]=="х" or a[i]=="ц" or a[i]== "ч" :   
        count+=5
    if a[i]== "ш" or a[i]=="э" or a[i]=="ю"  :
        count+=8
    if a[i]== "ф" or a[i]=="щ" or a[i]=="ъ" :     
        count+=10     

for i in range(len(a)):
    if a[i]== "a" or a[i]=="e" or a[i]=="i" or a[i]=="o" or a[i]== "u" or  a[i]=="l" or a[i]== "n" or a[i]=="s" or a[i]== "t"or a[i]== "r":
        count+=1
    if a[i]== "d" or a[i]=="j"  :
        count+=2
    if a[i]== "b" or a[i]=="c" or a[i]=="m" or a[i]=="p" :
        count+=3 
    if a[i]== "f" or a[i]=="h" or a[i]== "v" or a[i]=="w" or a[i]== "y" :
        count+=4    
    if a[i]== "k" :   
        count+=5
    if a[i]== "j" or a[i]=="x"   :
        count+=8
    if a[i]== "q" or a[i]=="z":     
        count+=10     


print(count)        